---
kind: property
id: P:Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalBefore
source: html/08acd3c1-af30-9cf5-55cb-c09f1df64c20.htm
---
# Autodesk.Revit.DB.SynchronizeWithCentralOptions.SaveLocalBefore Property

True means to save local before the first reload latest if there are changes not yet saved to local.
 True by default. Silently ignored if the model in the current session is central rather than local.

## Syntax (C#)
```csharp
public bool SaveLocalBefore { get; set; }
```